In [131]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import sys
import json

In [43]:
df = pd.read_csv('ex1.csv')

In [44]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [46]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [47]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [48]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [49]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [50]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [51]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [52]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [53]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [54]:
!type ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [55]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [56]:
result = pd.read_table('ex3.txt', sep='\s+')

In [57]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [58]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [59]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [60]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [61]:
result = pd.read_csv('ex5.csv')

In [62]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [63]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [64]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [65]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [66]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [67]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [68]:
result = pd.read_csv('ex6.csv')

In [69]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
5     1.817480  0.742273  0.419395 -2.251035   Q
6    -0.776764  0.935518 -0.332872 -1.875641   U
7    -0.913135  1.530624 -0.572657  0.477252   K
8     0.358480 -0.497572 -0.367016  0.507702   S
9    -1.740877 -1.160417 -1.637830  2.172201   G
10    0.240564 -0.328249  1.252155  1.072796   8
11    0.764018  1.165476 -0.639544  1.495258   R
12    0.571035 -0.310537  0.582437 -0.298765   1
13    2.317658  0.430710 -1.334216  0.199679   P
14    1.547771 -1.119753 -2.277634  0.329586   J
15   -1.310608  0.401719 -1.000987  1.156708   E
16   -0.088496  0.634712  0.153324  0.415335   B
17   -0.018663 -0.247487 -1.446522  0.750938   A
18   -0.070127 -1.579097  0.120892  0.671432   F
19   -0.194678 -0.492039  2.359605  0.319810   H
20   -0.248618  0.868707 -0.492226 -0.717959   W
21   -1.091549 -0.867110 -0.647760 -0.832562   C
22    0.641404 -0.138822 -0.621963 -0.284839   C
23    1.216408  0.992687  0.165162 -0.069619   V
24   -0.564474  0.792832  0.747053  0.571675   I
25    1.759879 -0.515666 -0.230481  1.362317   S
26    0.126266  0.309281  0.382820 -0.239199   L
27    1.334360 -0.100152 -0.840731 -0.643967   6
28   -0.737620  0.278087 -0.053235 -0.950972   J
29   -1.148486 -0.986292 -0.144963  0.124362   Y
...        ...       ...       ...       ...  ..
9970  0.633495 -0.186524  0.927627  0.143164   4
9971  0.308636 -0.112857  0.762842 -1.072977   1
9972 -1.627051 -0.978151  0.154745 -1.229037   Z
9973  0.314847  0.097989  0.199608  0.955193   P
9974  1.666907  0.992005  0.496128 -0.686391   S
9975  0.010603  0.708540 -1.258711  0.226541   K
9976  0.118693 -0.714455 -0.501342 -0.254764   K
9977  0.302616 -2.011527 -0.628085  0.768827   H
9978 -0.098572  1.769086 -0.215027 -0.053076   A
9979 -0.019058  1.964994  0.738538 -0.883776   F
9980 -0.595349  0.001781 -1.423355 -1.458477   M
9981  1.392170 -1.396560 -1.425306 -0.847535   H
9982 -0.896029 -0.152287  1.924483  0.365184   6
9983 -2.274642 -0.901874  1.500352  0.996541   N
9984 -0.301898  1.019906  1.102160  2.624526   I
9985 -2.548389 -0.585374  1.496201 -0.718815   D
9986 -0.064588  0.759292 -1.568415 -0.420933   E
9987 -0.143365 -1.111760 -1.815581  0.435274   2
9988 -0.070412 -1.055921  0.338017 -0.440763   X
9989  0.649148  0.994273 -1.384227  0.485120   Q
9990 -0.370769  0.404356 -1.051628 -1.050899   8
9991 -0.409980  0.155627 -0.818990  1.277350   W
9992  0.301214 -1.111203  0.668258  0.671922   A
9993  1.821117  0.416445  0.173874  0.505118   X
9994  0.068804  1.322759  0.802346  0.223618   H
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [70]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [71]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [72]:
chunker

In [73]:
tot = Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [76]:
tot = tot.sort_values(ascending=False)

In [79]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [81]:
data = pd.read_csv('ex5.csv')

In [82]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [83]:
data.to_csv('out.csv')

In [84]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [87]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [88]:
data.to_csv(sys.stdout, na_rep=False)

,something,a,b,c,d,message
0,one,1,2,3.0,4,False
1,two,5,6,False,8,world
2,three,9,10,11.0,12,foo

In [90]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [92]:
data.to_csv(sys.stdout, index=False, columns=list('abc'))

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [97]:
# Series也有to_csv方法
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [98]:
ts = Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [99]:
ts.to_csv('tseries.csv')

In [100]:
!type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [101]:
ts2 = pd.read_csv('tseries.csv')

In [102]:
ts2

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

In [103]:
Series.from_csv('tseries.csv', parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [105]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [108]:
import csv
fr = open('ex7.csv')

In [109]:
reader = csv.reader(fr)
for line in reader:
    print line

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [110]:
lines = list(csv.reader(open('ex7.csv')))

In [111]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3', '4']]

In [112]:
header, values = lines[0], lines[1:]

In [113]:
header

['a', 'b', 'c']

In [114]:
values

[['1', '2', '3'], ['1', '2', '3', '4']]

In [115]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [116]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [117]:
zip(*values)

[('1', '1'), ('2', '2'), ('3', '3')]

In [127]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_ALL

In [121]:
reader = csv.reader(fr, delimiter='|')

In [122]:
reader

In [128]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [129]:
!type mydata.csv

"one";"two";"three"
"1";"2";"3"
"4";"5";"6"
"7";"8";"9"

In [130]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
              {"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""

In [132]:
results = json.loads(obj)

In [133]:
results

{u'name': u'Wes',
 u'pet': None,
 u'places_lived': [u'United States', u'Spain', u'Germany'],
 u'siblings': [{u'age': 25, u'name': u'Scott', u'pet': u'Zuko'},
  {u'age': 33, u'name': u'Katie', u'pet': u'Cisco'}]}

In [134]:
type(results)

dict

In [135]:
asjson = json.dumps(results)

In [136]:
asjson

'{"pet": null, "siblings": [{"pet": "Zuko", "age": 25, "name": "Scott"}, {"pet": "Cisco", "age": 33, "name": "Katie"}], "name": "Wes", "places_lived": ["United States", "Spain", "Germany"]}'

In [141]:
results['siblings']

[{u'age': 25, u'name': u'Scott', u'pet': u'Zuko'},
 {u'age': 33, u'name': u'Katie', u'pet': u'Cisco'}]

In [144]:
siblings = DataFrame(results['siblings'], columns=['name', 'age'])

In [145]:
siblings

    name  age
0  Scott   25
1  Katie   33

In [149]:
from lxml.html import parse
from urllib2 import urlopen

# 二进制数据格式

In [151]:
frame = pd.read_csv('ex1.csv')

In [152]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [155]:
frame.to_pickle('frame_pickle')#写

In [157]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# 使用HDF5格式

In [158]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [164]:
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

ImportError: HDFStore requires PyTables, "Could not load any of ['hdf5.dll', 'hdf5dll.dll'], please ensure that it can be found in the system path" problem importing

In [166]:
xls_file = pd.ExcelFile('ex1.xlsx')

In [167]:
table = xls_file.parse('Sheet2')

In [168]:
table

   name  age
s  slis   28
h  herb   27
e  elie   28

In [169]:
type(table)

pandas.core.frame.DataFrame

# 使用HTML 和 Web API

In [170]:
import requests

In [ ]:
url = 'https://api.github.com/repos/pydata/pandas/milestones/28/labels'
resp = requests.get(url)

In [187]:
resp

In [188]:
data = json.loads(resp.text)

In [189]:
data

[{u'color': u'e10c02',
  u'default': False,
  u'id': 76811,
  u'name': u'Bug',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Bug'},
 {u'color': u'06909A',
  u'default': False,
  u'id': 2301354,
  u'name': u'Data IO',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Data%20IO'},
 {u'color': u'e102d8',
  u'default': False,
  u'id': 31404521,
  u'name': u'Dtypes',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Dtypes'},
 {u'color': u'5319e7',
  u'default': False,
  u'id': 47232590,
  u'name': u'IO SQL',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/IO%20SQL'},
 {u'color': u'4E9A06',
  u'default': False,
  u'id': 76812,
  u'name': u'Enhancement',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Enhancement'},
 {u'color': u'FCE94F',
  u'default': False,
  u'id': 127681,
  u'name': u'Refactor',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Refactor'},
 {u'color': u'0b02e1',
  u'default': False,
  u'id': 2822098,
  u'name': u'Indexing',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Indexing'},
 {u'color': u'5319e7',
  u'default': False,
  u'id': 49597148,
  u'name': u'Timedelta',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Timedelta'},
 {u'color': u'3465A4',
  u'default': False,
  u'id': 134699,
  u'name': u'Docs',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Docs'},
 {u'color': u'fbca04',
  u'default': False,
  u'id': 29648920,
  u'name': u'Difficulty Novice',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Difficulty%20Novice'},
 {u'color': u'eb6420',
  u'default': False,
  u'id': 60635328,
  u'name': u'Period',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Period'},
 {u'color': u'd7e102',
  u'default': False,
  u'id': 2822342,
  u'name': u'Missing-data',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Missing-data'},
 {u'color': u'AD7FA8',
  u'default': False,
  u'id': 35818298,
  u'name': u'API Design',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/API%20Design'},
 {u'color': u'e11d21',
  u'default': False,
  u'id': 78527356,
  u'name': u'Categorical',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Categorical'},
 {u'color': u'5319e7',
  u'default': False,
  u'id': 47229171,
  u'name': u'IO CSV',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/IO%20CSV'},
 {u'color': u'fbca04',
  u'default': False,
  u'id': 49094459,
  u'name': u'Internals',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Internals'},
 {u'color': u'207de5',
  u'default': False,
  u'id': 71268330,
  u'name': u'MultiIndex',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/MultiIndex'},
 {u'color': u'006b75',
  u'default': False,
  u'id': 47223669,
  u'name': u'Numeric',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Numeric'},
 {u'color': u'0052cc',
  u'default': False,
  u'id': 53181044,
  u'name': u'Frequency',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Frequency'},
 {u'color': u'a10c02',
  u'default': False,
  u'id': 8935311,
  u'name': u'Performance',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Performance'},
 {u'color': u'5319e7',
  u'default': False,
  u'id': 60458168,
  u'name': u'Timezones',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Timezones'},
 {u'color': u'8AE234',
  u'default': False,
  u'id': 2413328,
  u'name': u'Visualization',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Visualization'},
 {u'color': u'02d7e1',
  u'default': False,
  u'id': 13098779,
  u'name': u'Reshaping',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Reshaping'},
 {u'color': u'75507B',
  u'default': False,
  u'id': 129350,
  u'name': u'Build',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Build'},
 {u'color': u'DDDDDD',
  u'default': False,
  u'id': 32933285,
  u'name': u'Admin',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Admin'},
 {u'color': u'a2bca7',
  u'default': False,
  u'id': 48070600,
  u'name': u'CI',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/CI'},
 {u'color': u'fbca04',
  u'default': False,
  u'id': 57186974,
  u'name': u'Windows',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Windows'},
 {u'color': u'ffa0ff',
  u'default': False,
  u'id': 42670965,
  u'name': u'Error Reporting',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Error%20Reporting'},
 {u'color': u'eb6420',
  u'default': False,
  u'id': 57296398,
  u'name': u'Algos',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Algos'},
 {u'color': u'729FCF',
  u'default': False,
  u'id': 233160,
  u'name': u'Groupby',
  u'url': u'https://api.github.com/repos/pandas-dev/pandas/labels/Groupby'}]

In [190]:
columns = ['id', 'name', 'color', 'url']

In [191]:
data_frame = DataFrame(data, columns=columns)

In [192]:
data_frame.head()

,id,name,color,url
0,76811,Bug,e10c02,https://api.github.com/repos/pandas-dev/pandas...
1,2301354,Data IO,06909A,https://api.github.com/repos/pandas-dev/pandas...
2,31404521,Dtypes,e102d8,https://api.github.com/repos/pandas-dev/pandas...
3,47232590,IO SQL,5319e7,https://api.github.com/repos/pandas-dev/pandas...
4,76812,Enhancement,4E9A06,https://api.github.com/repos/pandas-dev/pandas...

# 使用数据库

In [193]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [196]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

con.executemany(stmt, data)
con.commit()

In [197]:
cursor = con.execute('select * from test')

In [198]:
rows = cursor.fetchall()

In [199]:
rows

[(u'Atlanta', u'Georgia', 1.25, 6),
 (u'Tallahassee', u'Florida', 2.6, 3),
 (u'Sacramento', u'California', 1.7, 5)]

In [202]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [207]:
zip(*cursor.description)

[('a', 'b', 'c', 'd'),
 (None, None, None, None),
 (None, None, None, None),
 (None, None, None, None),
 (None, None, None, None),
 (None, None, None, None),
 (None, None, None, None)]

In [204]:
DataFrame(rows, columns=zip(*cursor.description)[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [208]:
import pandas.io.sql as sql
sql.read_frame('select * from test', con)

AttributeError: 'module' object has no attribute 'read_frame'